app/views/credit_cards/index.html.erb

SELECT "credit_cards".* FROM "credit_cards" WHERE "credit_cards"."user_id" = 2
SELECT 1 AS one FROM "credit_cards" WHERE "credit_cards"."user_id" = 2 LIMIT 1
---

<% if @user.credit_cards.any? %>
  <ul>
    <% @user.credit_cards.each do |credit_card| %>