app/views/tickets/new.html.erb

SELECT "users".* FROM "users"
---
      <%= f.label :user_id, "User" %>
      <%= f.collection_select :user_id, User.all, :id, :username, prompt: "Select a user" %>

SELECT "shows".* FROM "shows"
---
      <%= f.label :show_id, "Show" %>
      <%= f.collection_select :show_id, Show.all, :id, lambda { |s| "#{s.movie.title} - #{s.date.strftime('%B %d, %Y')} - #{s.time.strftime('%H:%M')}" }, prompt: "Select a show" %>