app/controllers/credit_cards_controller.rb

INSERT INTO "credit_cards" ("card_number", "expiration_date", "user_id", "created_at", "updated_at") VALUES ('1234', '2025-02-18', 3, '2025-02-18 19:11:17.407208', '2025-02-18 19:11:17.407208') RETURNING "id"
---
  def create
    @credit_card = @user.credit_cards.build(credit_card_params)
    if @credit_card.save

SELECT "credit_cards".* FROM "credit_cards" WHERE "credit_cards"."user_id" = 2 AND "credit_cards"."id" = 1 LIMIT 1
DELETE FROM "credit_cards" WHERE "credit_cards"."id" = 1
---
  def destroy
    @credit_card = @user.credit_cards.find(params[:id])
    @credit_card.destroy