app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("title", "genre", "duration", "language", "rating", "release_date", "created_at", "updated_at") VALUES ('test', 'test', 12, 'en', 'test', '2025-02-18', '2025-02-18 04:20:16.682029', '2025-02-18 04:20:16.682029') RETURNING "id"

  def update
    if @movie.update(movie_params)
---
UPDATE "movies" SET "title" = 'Home Alone', "genre" = 'comedy', "duration" = 120, "rating" = 'g', "updated_at" = '2025-02-18 19:55:53.208910' WHERE "movies"."id" = 1