app/controllers/sessions_controller.rb

  def create
    # Change this to find user by username instead of email
    user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'felix' LIMIT 1