app/controllers/shows_controller.rb

INSERT INTO "shows" ("movie_id", "date", "time", "seats_available", "ticket_price", "created_at", "updated_at") VALUES (5, '2025-02-18', '2000-01-01 00:12:00', 12, 2, '2025-02-18 20:31:35.632905', '2025-02-18 20:31:35.632905') RETURNING "id"
---
  def create
    @show = @movie.shows.build(show_params)
    if @show.save

UPDATE "shows" SET "seats_available" = 3, "updated_at" = '2025-02-18 20:14:50.868263' WHERE "shows"."id" = 2
---
  def update
    if @show.update(show_params)

DELETE FROM "shows" WHERE "shows"."id" = 4
---
  def destroy
    @show.destroy

SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1
---
  def set_movie
    @movie = Movie.find(params[:movie_id])  # Find movie by movie_id param in the URL

SELECT "shows".* FROM "shows" WHERE "shows"."movie_id" = 1 AND "shows"."id" = 2 LIMIT 1
---
  def set_show
    @show = @movie.shows.find(params[:id])