app/controllers/tickets_controller.rb

SELECT "shows".* FROM "shows" WHERE "shows"."id" IN (1, 2)
SELECT "tickets".* FROM "tickets" WHERE "tickets"."user_id" = 2 ORDER BY "tickets"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2)
---
  def index
    if current_user.admin?
      @tickets = Ticket.includes(:show, :user).order(created_at: :desc)

SELECT "shows".* FROM "shows" WHERE "shows"."id" = 5 LIMIT 1
---
  def new
    if current_user.admin? && params[:show_id].blank?
      @ticket = Ticket.new
    else
      @show = Show.find(params[:show_id])

SELECT "shows".* FROM "shows" WHERE "shows"."id" = 5 LIMIT 1
SELECT "tickets".* FROM "tickets" WHERE "tickets"."user_id" = 2 AND "tickets"."id" = 13 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "shows".* FROM "shows" WHERE "shows"."id" = 1 LIMIT 1
UPDATE "tickets" SET "status" = 'Cancelled', "updated_at" = '2025-02-18 19:29:50.892689' WHERE "tickets"."id" = 20
UPDATE "shows" SET "seats_available" = 6, "updated_at" = '2025-02-18 21:28:18.604897' WHERE "shows"."id" = 5
INSERT INTO "tickets" ("user_id", "show_id", "confirmation_number", "status", "created_at", "updated_at", "credit_card_id") VALUES (3, 1, '1DC5C9BE540D5C0A', 'Booked', '2025-02-23 02:07:21.900290', '2025-02-23 02:07:21.900290', 1) RETURNING "id"
UPDATE "shows" SET "seats_available" = 11, "updated_at" = '2025-02-23 02:07:21.903452' WHERE "shows"."id" = 1
---
  def create
    if current_user.admin?
      @show = Show.find(ticket_params[:show_id]) # Admin selects the show from the form
      @ticket = @show.tickets.build(ticket_params)
      @ticket.user = User.find(ticket_params[:user_id])
    else
      @show = Show.find(ticket_params[:show_id]) # Regular users book from a specific show page
      @ticket = @show.tickets.build(ticket_params)
      @ticket.user = current_user

      # Ensure a credit card is selected for regular users
      if ticket_params[:credit_card_id].blank?
        redirect_to new_ticket_path(show_id: @show.id), alert: "A credit card must be selected to book the ticket."
        return
      end
    end

    if @show.movie.release_date > Date.today
      redirect_to movie_show_path(@show.movie, @show), alert: "Tickets for this movie are not available yet as the movie hasn't been released."
      return
    end

    if @show.seats_available > 0
      @ticket.status = "Booked"

      if @ticket.save
        @show.update(seats_available: @show.seats_available - 1)

UPDATE "shows" SET "seats_available" = 7, "updated_at" = '2025-02-18 21:36:52.209655' WHERE "shows"."id" = 5
UPDATE "tickets" SET "show_id" = 6, "updated_at" = '2025-02-18 21:36:52.206862' WHERE "tickets"."id" = 24
UPDATE "shows" SET "seats_available" = 49, "updated_at" = '2025-02-18 21:36:52.213093' WHERE "shows"."id" = 6
---
  def update
    old_show = @ticket.show

    if @ticket.update(ticket_params)
      if @ticket.show != old_show
        old_show.update(seats_available: old_show.seats_available + 1) # Increment for old show
        @ticket.show.update(seats_available: @ticket.show.seats_available - 1) # Decrement for new show

SELECT "tickets".* FROM "tickets" WHERE "tickets"."user_id" = 5 AND "tickets"."id" = 3 LIMIT 1
UPDATE "shows" SET "seats_available" = 1, "updated_at" = '2025-02-18 16:44:01.204864' WHERE "shows"."id" = 1
UPDATE "tickets" SET "status" = 'Cancelled', "updated_at" = '2025-02-23 02:18:06.078698' WHERE "tickets"."id" = 3
UPDATE "shows" SET "seats_available" = 10, "updated_at" = '2025-02-23 02:18:06.082448' WHERE "shows"."id" = 1
---
  def cancel
    @ticket = current_user.tickets.find(params[:id])
    @show = @ticket.show

    if @ticket.update(status: "Cancelled")
      # Increase available seats for the show
      @show.update(seats_available: @show.seats_available + 1)

DELETE FROM "tickets" WHERE "tickets"."id" = 27
UPDATE "shows" SET "seats_available" = 50, "updated_at" = '2025-02-18 21:40:08.098361' WHERE "shows"."id" = 6
---
  def destroy
    if current_user.admin?
      @show = @ticket.show
      if @ticket.destroy
        # Increment the seats_available for the show when the ticket is deleted
        @show.update(seats_available: @show.seats_available + 1)