app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "name", "email", "password_digest", "created_at", "updated_at", "admin", "default", "false", "phone_number", "address") VALUES ('felix', 'felix', 'felix@cats.com', '$2a$12$39GcJi7g9qUiZlMz5Z3fNOGQ9bYSngCOZ13Mclc/GOGG6BhAgtRt6', '2025-02-12 20:58:07.286564', '2025-02-12 20:58:07.286564', NULL, NULL, NULL, NULL, NULL) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = '2025-02-12 21:09:48.311827', "phone_number" = '1231231234', "address" = '' WHERE "users"."id" = 4

  def destroy
    @user.tickets.destroy_all
    @user.destroy
---
DELETE FROM "tickets" WHERE "tickets"."id" = 1
DELETE FROM "users" WHERE "users"."id" = 3
DELETE FROM "users" WHERE "users"."id" = 5