app/models/ticket.rb

UPDATE "shows" SET "seats_available" = 8, "updated_at" = '2025-02-23 02:26:09.093573' WHERE "shows"."id" = 1
---
  def increment_seats_available
    show.update(seats_available: show.seats_available + 1) if show.present?